Revit 2024 API
LoadCombinationType Enumeration
 Specifies load combination type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum LoadCombinationType
Visual Basic
Public Enumeration LoadCombinationType
Visual C++
public enum class LoadCombinationType
Members
Member name | Description
Combination |  Combination
Envelope |  Envelope
See Also
Autodesk.Revit.DB.Structure Namespace